Repository: TianLang-Hacker/ClashWinUI
Catalog: i18n/*/Resources.resw
Source language: en_us
Languages: zh_hans, zh_hant

# NavOverview
source: Overview
zh_hans: 概览
zh_hant: 概覽

# NavProfiles
source: Profiles
zh_hans: 订阅
zh_hant: 訂閱

# NavProxies
source: Proxies
zh_hans: 代理
zh_hant: 代理

# NavConnections
source: Connections
zh_hans: 连接
zh_hant: 連線

# NavLogs
source: Logs
zh_hans: 日志
zh_hant: 日誌

# NavRules
source: Rules
zh_hans: 规则
zh_hant: 規則

# NavSettings
source: Settings
zh_hans: 设置
zh_hant: 設定

# PageOverview
source: Overview
zh_hans: 概览
zh_hant: 概覽

# HomeMetricConnections
source: Current Connections
zh_hans: 当前连接
zh_hant: 目前連線

# HomeMetricMemoryUsage
source: Memory Usage
zh_hans: 内存使用
zh_hant: 記憶體使用

# HomeMetricDownloadTotal
source: Total Download
zh_hans: 下载总量
zh_hant: 下載總量

# HomeMetricDownloadSpeed
source: Download Speed
zh_hans: 下载速度
zh_hant: 下載速度

# HomeMetricUploadTotal
source: Total Upload
zh_hans: 上传总量
zh_hant: 上傳總量

# HomeMetricUploadSpeed
source: Upload Speed
zh_hans: 上传速度
zh_hant: 上傳速度

# HomeTrafficChartTitle
source: Upload and Download Speed
zh_hans: 上传与下载速度
zh_hant: 上傳与下載速度

# HomeLegendDownload
source: Download
zh_hans: 下载
zh_hant: 下載

# HomeLegendUpload
source: Upload
zh_hans: 上传
zh_hant: 上傳

# HomeMemoryChartTitle
source: Memory Usage
zh_hans: 内存使用
zh_hant: 記憶體使用

# HomeLegendMemory
source: Memory
zh_hans: 内存
zh_hant: 記憶體

# HomeSectionNetwork
source: Network Info
zh_hans: 网络信息
zh_hant: 網路資訊

# HomeFieldPublicIp
source: Public IP
zh_hans: 公网 IP
zh_hant: 公網 IP

# HomeShowPublicIpTooltip
source: Show public IP
zh_hans: 显示公网 IP
zh_hant: 顯示公網 IP

# HomeHidePublicIpTooltip
source: Hide public IP
zh_hans: 隐藏公网 IP
zh_hant: 隱藏公網 IP

# HomeCopyPublicIpTooltip
source: Copy public IP
zh_hans: 复制公网 IP
zh_hant: 複製公網 IP

# HomeFieldLocation
source: Location
zh_hans: 归属地
zh_hant: 歸屬地

# HomeFieldAsn
source: AS Number
zh_hans: AS 号
zh_hant: AS 号

# HomeFieldServiceProvider
source: Service Provider
zh_hans: 服务商
zh_hant: 服務商

# HomeFieldOrganization
source: Organization
zh_hans: 组织
zh_hant: 組織

# HomeFieldTimeZone
source: Time Zone
zh_hans: 时区
zh_hant: 時區

# HomeFieldCoordinates
source: Coordinates
zh_hans: 经纬度
zh_hant: 經緯度

# HomeNetworkInfoLookupFailed
source: Failed to load public network info.
zh_hans: 获取公网网络信息失败。
zh_hant: 取得公網網路資訊失敗。

# HomeSectionMihomo
source: Mihomo Kernel
zh_hans: Mihomo 内核信息
zh_hant: Mihomo 核心資訊

# HomeFieldKernelVersion
source: Kernel Version
zh_hans: 内核版本
zh_hant: 核心版本

# HomeFieldSystemProxy
source: System Proxy
zh_hans: 系统代理
zh_hant: 系統代理

# HomeFieldMixinPorts
source: Mixin Ports
zh_hans: Mixin 端口
zh_hant: Mixin 連接埠

# HomeFieldRuntimeEvents
source: Runtime Events
zh_hans: 运行事件
zh_hant: 執行事件

# HomeFieldRulesCount
source: Rules Count
zh_hans: 规则数量
zh_hant: 規則数量

# HomeFieldTunStatus
source: TUN Status
zh_hans: TUN 状态
zh_hant: TUN 狀態

# HomeFieldTunSummary
source: TUN Summary
zh_hans: TUN 摘要
zh_hant: TUN 摘要

# HomeSectionSystem
source: System Info
zh_hans: 系统信息
zh_hant: 系統資訊

# HomeFieldOperatingSystem
source: Operating System
zh_hans: 操作系统
zh_hant: 作業系統

# HomeFieldSystemVersion
source: System Version
zh_hans: 系统版本号
zh_hant: 系統版本號

# PageProfiles
source: Profiles
zh_hans: 订阅
zh_hant: 訂閱

# PageProxies
source: Proxies
zh_hans: 代理
zh_hant: 代理

# PageConnections
source: Connections
zh_hans: 连接
zh_hant: 連線

# ConnectionsActiveBadge
source: Active
zh_hans: 活跃
zh_hant: 活躍

# ConnectionsClosedBadge
source: Closed
zh_hans: 已关闭
zh_hant: 已關閉

# ConnectionsSearchPlaceholder
source: Search multiple keywords separated by spaces
zh_hans: 搜索 多个关键词用空格分隔
zh_hant: 搜尋 多個關鍵字用空格分隔

# ConnectionsColumnClose
source: Close
zh_hans: 关闭
zh_hant: 關閉

# ConnectionsColumnHost
source: Host
zh_hans: 主机
zh_hant: 主機

# ConnectionsColumnType
source: Type
zh_hans: 类型
zh_hant: 類型

# ConnectionsColumnRule
source: Rule
zh_hans: 规则
zh_hant: 規則

# ConnectionsColumnChain
source: Proxy Chain
zh_hans: 代理链
zh_hant: 代理鏈

# ConnectionsColumnDownloadSpeed
source: Download Speed
zh_hans: 下载速度
zh_hant: 下載速度

# ConnectionsColumnUploadSpeed
source: Upload Speed
zh_hans: 上传速度
zh_hant: 上傳速度

# ConnectionsColumnDownload
source: Download
zh_hans: 下载
zh_hant: 下載

# ConnectionsColumnUpload
source: Upload
zh_hans: 上传
zh_hant: 上傳

# ConnectionsColumnDuration
source: Duration
zh_hans: 连接时间
zh_hant: 連線时间

# ConnectionsCloseTooltip
source: Close this connection
zh_hans: 关闭该连接
zh_hant: 關閉此連線

# ConnectionsStatusEmpty
source: No active connections.
zh_hans: 当前没有活跃连接。
zh_hant: 目前沒有活躍連線。

# ConnectionsStatusLoaded
source: Loaded {0} connections.
zh_hans: 已加载 {0} 个连接。
zh_hant: 已載入 {0} 個連線。

# ConnectionsStatusLoadFailed
source: Failed to load connections: {0}
zh_hans: 加载连接失败：{0}
zh_hant: 載入連線失敗：{0}

# ConnectionsStatusClosed
source: Closed connection: {0}
zh_hans: 已关闭连接：{0}
zh_hant: 已關閉連線：{0}

# ConnectionsStatusCloseFailed
source: Failed to close connection: {0}
zh_hans: 关闭连接失败：{0}
zh_hant: 關閉連線失敗：{0}

# PageLogs
source: Logs
zh_hans: 日志
zh_hant: 日誌

# PageRules
source: Rules
zh_hans: 规则
zh_hant: 規則

# RulesSearchPlaceholder
source: Search | Separate keywords with spaces
zh_hans: 搜索 | 多个关键词用空格分隔
zh_hant: 搜尋 | 多個關鍵字用空格分隔

# RulesNoActiveProfile
source: No active profile.
zh_hans: 当前没有激活配置。
zh_hant: 目前沒有啟用中的設定。

# RulesStatusEmpty
source: No rules are available for the current profile.
zh_hans: 当前配置没有可显示的规则。
zh_hant: 目前設定沒有可顯示的規則。

# RulesStatusLoaded
source: Loaded {0} rules.
zh_hans: 已加载 {0} 条规则。
zh_hant: 已載入 {0} 條規則。

# RulesStatusLoadFailed
source: Failed to load rules: {0}
zh_hans: 加载规则失败：{0}
zh_hant: 載入規則失敗：{0}

# RulesStatusApplied
source: Rule updated and applied: {0}
zh_hans: 规则已更新并立即生效：{0}
zh_hant: 規則已更新並立即生效：{0}

# RulesStatusApplyFailed
source: Failed to apply the updated rule.
zh_hans: 规则应用失败。
zh_hant: 規則套用失敗。

# PageSettings
source: Settings
zh_hans: 设置
zh_hant: 設定

# LogsCopyButton
source: Copy All Logs
zh_hans: 复制全部日志
zh_hant: 複製全部日誌

# LogsSaveButton
source: Download Logs
zh_hans: 下载日志
zh_hant: 下載日誌

# LogsAutoScrollButton
source: Auto Scroll
zh_hans: 自动滚动
zh_hant: 自動捲動

# LogsClearButton
source: Clear Logs
zh_hans: 清空日志
zh_hant: 清空日誌

# LogsFilterAll
source: All
zh_hans: 全部
zh_hant: 全部

# LogsSearchPlaceholder
source: Search log message keyword
zh_hans: 搜索日志关键字
zh_hant: 搜尋日誌關鍵字

# SettingsSection1
source: General
zh_hans: 通用
zh_hant: 通用

# SettingsSection2
source: Proxy Settings
zh_hans: 代理设置
zh_hant: 代理設定

# LanguageTraditionalChinese
source: 中文（繁體）
zh_hans: 中文（繁体）

# SettingsThirdPartyLibrariesHeader
source: Third-Party Libraries
zh_hans: 第三方库
zh_hant: 第三方庫

# CloseBehaviorHeader
source: Close behavior
zh_hans: 关闭行为
zh_hant: 關閉行為

# CloseBehaviorDescription
source: Choose whether clicking the close button minimizes to tray or exits directly.
zh_hans: 选择点击关闭按钮时是最小化到托盘，还是直接退出。
zh_hant: 選擇點擊關閉按鈕時是最小化到系統匣，還是直接結束。

# CloseBehaviorMinimizeToTray
source: Minimize to tray
zh_hans: 最小化到托盘
zh_hant: 最小化到系統匣

# CloseBehaviorExit
source: Exit directly
zh_hans: 直接退出
zh_hant: 直接結束

# ProxyGroupsExpandedByDefaultHeader
source: Proxy group expansion
zh_hans: 代理组展开状态
zh_hant: 代理群組展開狀態

# ProxyGroupsExpandedByDefaultDescription
source: Choose whether proxy groups start expanded or collapsed when the Proxies page loads or reloads.
zh_hans: 控制进入代理页面或重新加载代理组时，代理组下拉菜单默认展开还是收起。
zh_hant: 控制進入代理頁面或重新載入代理群組時，代理群組下拉選單預設展開還是收起。

# ProxyGroupsExpandedByDefaultToggleLabel
source: Expand proxy groups by default
zh_hans: 默认展开代理组
zh_hant: 預設展開代理群組

# KernelPathHeader
source: Kernel Path
zh_hans: 内核路径
zh_hant: 核心路徑

# KernelPathDescription
source: Select and save a custom kernel executable path.
zh_hans: 选择并保存自定义内核可执行文件路径。
zh_hant: 選擇並儲存自訂核心可執行檔路徑。

# KernelPathPlaceholder
source: Choose local kernel executable path
zh_hans: 请选择本地内核可执行文件路径
zh_hant: 請選擇本機核心可執行檔路徑

# KernelPathBrowseButton
source: Browse
zh_hans: 浏览
zh_hant: 瀏覽

# KernelPathSaveButton
source: Save
zh_hans: 保存
zh_hant: 儲存

# GeoDataCardHeader
source: Update GeoData
zh_hans: 更新 GeoData
zh_hant: 更新 GeoData

# GeoDataCardDescription
source: Download and refresh the GeoData files Mihomo uses (geoip.metadb, geoip.dat, geosite.dat).
zh_hans: 下载并刷新 Mihomo 使用的 GeoData（geoip.metadb、geoip.dat、geosite.dat）。
zh_hant: 下載並重新整理 Mihomo 使用的 GeoData（geoip.metadb、geoip.dat、geosite.dat）。

# GeoDataUpdatingLabel
source: Updating
zh_hans: 更新中
zh_hant: 更新中

# GeoDataStatusUpdated
source: GeoData update completed.
zh_hans: GeoData 更新完成。
zh_hant: GeoData 更新完成。

# GeoDataStatusEnsureFailedFormat
source: GeoData prepare failed: {0}
zh_hans: GeoData 准备失败：{0}
zh_hant: GeoData 準備失敗：{0}

# GeoDataStatusUpdateFailedFormat
source: GeoData update failed: {0}
zh_hans: GeoData 更新失败：{0}
zh_hant: GeoData 更新失敗：{0}

# GeoDataStatusControllerFailureFormat
source: GeoData prepare failed. The current config depends on GeoData, so Mihomo could not start the controller: {0}
zh_hans: GeoData 准备失败，当前配置依赖 GeoData，Mihomo 无法启动控制器：{0}
zh_hant: GeoData 準備失敗，目前設定依賴 GeoData，Mihomo 無法啟動控制器：{0}

# GeoDataStatusUnknownReason
source: Unknown reason
zh_hans: 未知原因
zh_hant: 未知原因

# MihomoStatusUnknownReason
source: Unknown reason
zh_hans: 未知原因
zh_hant: 未知原因

# SystemProxyStatusEnabledFormat
source: Enabled ({0})
zh_hans: 已启用（{0}）
zh_hant: 已啟用（{0}）

# SystemProxyStatusEnabledWithoutAddress
source: Enabled
zh_hans: 已启用
zh_hant: 已啟用

# SystemProxyStatusDisabled
source: Disabled
zh_hans: 已关闭
zh_hant: 已關閉

# TunStatusDependencyFailureFormat
source: TUN dependency preparation failed: {0}
zh_hans: TUN 依赖准备失败：{0}
zh_hant: TUN 依賴準備失敗：{0}

# TunStatusPermissionFailureFormat
source: TUN requires administrator privileges or elevated access: {0}
zh_hans: 启用 TUN 需要管理员权限或更高访问权限：{0}
zh_hant: 啟用 TUN 需要系統管理員權限或更高存取權限：{0}

# TunStatusAdapterMissingFormat
source: TUN is configured, but the adapter is missing: {0}
zh_hans: TUN 已配置，但适配器未建立：{0}
zh_hant: TUN 已設定，但介面卡未建立：{0}

# TunStatusRouteMissingFormat
source: TUN adapter exists, but routes were not attached: {0}
zh_hans: TUN 适配器已存在，但路由未附着：{0}
zh_hant: TUN 介面卡已存在，但路由未附著：{0}

# TunStatusDnsUnmanagedFormat
source: TUN routes are attached, but DNS is not managed: {0}
zh_hans: TUN 路由已接管，但 DNS 未托管：{0}
zh_hant: TUN 路由已接管，但 DNS 未受控：{0}

# TunStatusFirewallBlockedFormat
source: TUN adapter exists, but Windows Firewall may be blocking the current stack: {0}
zh_hans: TUN 适配器已存在，但 Windows 防火墙可能阻断了当前栈：{0}
zh_hant: TUN 介面卡已存在，但 Windows 防火牆可能阻擋了目前的堆疊：{0}

# TunStatusControllerFailureFormat
source: TUN is enabled, but Mihomo could not start the controller: {0}
zh_hans: 当前已启用 TUN，但 Mihomo 无法启动控制器：{0}
zh_hant: 目前已啟用 TUN，但 Mihomo 無法啟動控制器：{0}

# TunRuntimeStatusDisabled
source: Disabled
zh_hans: 未启用
zh_hant: 未啟用

# TunRuntimeStatusEnabled
source: Enabled
zh_hans: 已启用

# TunRuntimeStatusActive
source: Active
zh_hans: 已生效
zh_hant: 已生效

# TunRuntimeStatusPending
source: Configured, but currently not active
zh_hans: 已配置，但当前未生效
zh_hant: 已設定，但目前未生效

# TunRuntimeSummaryFallbackProxyFormat
source: TUN is not active. Traffic is still using system proxy {0}.
zh_hans: TUN 未生效，当前仍依赖系统代理 {0}。
zh_hant: TUN 未生效，目前仍依賴系統代理 {0}。

# TunRuntimeSummaryFallbackProxyNoAddress
source: TUN is not active. Traffic is still using the system proxy.
zh_hans: TUN 未生效，当前仍依赖系统代理。
zh_hant: TUN 未生效，目前仍依賴系統代理。

# TunRuntimeSummaryUnprotected
source: TUN is not active and system proxy is off. Current traffic will not be proxied.
zh_hans: TUN 未生效，且系统代理已关闭，当前流量不会被代理。
zh_hant: TUN 未生效，且系統代理已關閉，目前流量不會被代理。

# TunRuntimeSummaryDnsUnmanaged
source: TUN routes are attached, but DNS is not managed for this profile. Website resolution may fail when system proxy is off.
zh_hans: TUN 路由已接管，但当前 profile 未托管 DNS。关闭系统代理后，网站解析可能失败。
zh_hant: TUN 路由已接管，但目前的 profile 未託管 DNS。關閉系統代理後，網站解析可能失敗。

# SettingsMixinHeader
source: Runtime Config
zh_hans: 运行配置
zh_hant: 執行設定

# SettingsMixinDescription
source: Edit the active profile mixin.yaml and rebuild runtime.yaml.
zh_hans: 编辑当前激活配置的 mixin.yaml，并重建 runtime.yaml。
zh_hant: 編輯目前啟用設定的 mixin.yaml，並重建 runtime.yaml。

# SettingsMixinCurrentProfileLabel
source: Current profile
zh_hans: 当前配置
zh_hant: 目前設定

# SettingsMixinWorkspaceLabel
source: Workspace
zh_hans: 工作区
zh_hant: 工作區

# SettingsMixinNoActiveProfile
source: Please activate a profile first.
zh_hans: 请先激活一个配置。
zh_hant: 請先啟用一個設定。

# SettingsMixinMixedPortLabel
source: Mixed Port
zh_hans: Mixed 端口
zh_hant: Mixed 連接埠

# SettingsMixinHttpPortLabel
source: HTTP Port
zh_hans: HTTP 端口
zh_hant: HTTP 連接埠

# SettingsMixinSocksPortLabel
source: Socks Port
zh_hans: Socks 端口
zh_hant: Socks 連接埠

# SettingsMixinRedirPortLabel
source: Redir Port
zh_hans: Redir 端口
zh_hant: Redir 連接埠

# SettingsMixinTProxyPortLabel
source: TProxy Port
zh_hans: TProxy 端口
zh_hant: TProxy 連接埠

# SettingsTunCardHeader
source: Tun Mode
zh_hans: Tun 模式

# SettingsTunCardDescription
source: Control TUN mode separately for the active profile and show the current runtime status.
zh_hans: 独立控制当前激活配置的 TUN 模式，并显示当前运行状态。

# SettingsMixinAllowLanLabel
source: Allow LAN
zh_hans: 允许局域网
zh_hant: 允許區域網路

# SettingsMixinModeLabel
source: Mode
zh_hans: 模式
zh_hant: 模式

# SettingsMixinLogLevelLabel
source: Log Level
zh_hans: 日志级别
zh_hant: 日誌级别

# SettingsMixinModeRule
source: Rule
zh_hans: 规则
zh_hant: 規則

# SettingsMixinModeGlobal
source: Global
zh_hans: 全局
zh_hant: 全域

# SettingsMixinModeDirect
source: Direct
zh_hans: 直连
zh_hant: 直連

# SettingsMixinLogLevelDebug
source: Debug
zh_hans: 调试
zh_hant: 偵錯

# SettingsMixinLogLevelInfo
source: Info
zh_hans: 信息
zh_hant: 資訊

# SettingsMixinLogLevelWarning
source: Warning
zh_hans: 警告
zh_hant: 警告

# SettingsMixinLogLevelError
source: Error
zh_hans: 错误
zh_hant: 錯誤

# SettingsMixinOpenFolderButton
source: Open Folder
zh_hans: 打开文件夹
zh_hant: 開啟資料夾

# SettingsMixinPortSettingsButton
source: Port Settings
zh_hans: 端口设置
zh_hant: 連接埠設定

# PortSettingsWindowTitle
source: Port Settings
zh_hans: 端口设置
zh_hant: 連接埠設定

# PortSettingsWindowDescription
source: Edit ports here. Confirm applies immediately; cancel discards the current draft.
zh_hans: 编辑端口配置后点击确认立即生效；点击取消则放弃这次修改。
zh_hant: 編輯連接埠設定後點擊確認立即生效；點擊取消則放棄這次修改。

# PortSettingsWindowCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# PortSettingsWindowConfirmButton
source: Confirm
zh_hans: 确认
zh_hant: 確認

# SettingsMixinStatusApplied
source: Mixin saved and runtime applied.
zh_hans: Mixin 已保存，runtime 已生效。
zh_hant: Mixin 已儲存，runtime 已生效。

# SettingsMixinStatusApplyFailed
source: Runtime generated, but Mihomo apply failed.
zh_hans: runtime 已生成，但应用到 Mihomo 失败。
zh_hant: runtime 已生成，但套用到 Mihomo 失敗。

# SettingsMixinStatusLoadFailed
source: Failed to load mixin settings: {0}
zh_hans: 加载 mixin 设置失败：{0}
zh_hant: 載入 mixin 設定失敗：{0}

# ThemeHeader
source: Theme
zh_hans: 主题
zh_hant: 主題

# ThemeDescription
source: Switch application theme and backdrop.
zh_hans: 切换应用主题和窗口背景材质。
zh_hant: 切換應用程式主題與視窗背景材質。

# ThemeModeLabel
source: App theme
zh_hans: 应用主题
zh_hant: 應用程式主題

# ThemeModeSystem
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# ThemeModeLight
source: Light
zh_hans: 浅色
zh_hant: 淺色

# ThemeModeDark
source: Dark
zh_hans: 深色
zh_hant: 深色

# ThemeBackdropLabel
source: Window backdrop
zh_hans: 窗口背景
zh_hant: 視窗背景

# LanguageHeader
source: Language
zh_hans: 语言
zh_hant: 語言

# LanguageDescription
source: Switch app language instantly.
zh_hans: 即时切换应用语言。
zh_hant: 即時切換應用程式語言。

# ProfilesRefreshButton
source: Refresh
zh_hans: 刷新
zh_hant: 重新整理

# ProfilesImportLocalButton
source: Import Local
zh_hans: 导入本地
zh_hant: 匯入本機

# ProfilesDeleteButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# ProfilesSubscriptionUrlLabel
source: Subscription URL
zh_hans: 订阅链接
zh_hant: 訂閱連結

# ProfilesSubscriptionUrlPlaceholder
source: Paste Clash subscription URL
zh_hans: 粘贴 Clash 订阅链接
zh_hant: 貼上 Clash 訂閱連結

# ProfilesFetchButton
source: Fetch & Save
zh_hans: 获取并保存
zh_hant: 取得並儲存

# ProfilesNoActive
source: None
zh_hans: 无
zh_hant: 無

# ProfilesActiveLabel
source: Active profile
zh_hans: 当前配置
zh_hant: 目前設定

# ProfilesStatusFetchedAndApplied
source: Subscription fetched and applied to Mihomo.
zh_hans: 订阅已获取并应用到 Mihomo。
zh_hant: 訂閱已取得並套用到 Mihomo。

# ProfilesStatusFetchedOnly
source: Subscription fetched, but Mihomo apply failed.
zh_hans: 订阅已获取，但应用到 Mihomo 失败。
zh_hant: 訂閱已取得，但套用到 Mihomo 失敗。

# ProfilesStatusImportedAndApplied
source: Local profile imported and applied.
zh_hans: 本地配置已导入并应用。
zh_hant: 本機設定已匯入並套用。

# ProfilesStatusImportedOnly
source: Local profile imported, but Mihomo apply failed.
zh_hans: 本地配置已导入，但应用到 Mihomo 失败。
zh_hant: 本機設定已匯入，但套用到 Mihomo 失敗。

# ProfilesStatusActivated
source: Profile activated and applied.
zh_hans: 配置已激活并应用。
zh_hant: 設定已啟用並套用。

# ProfilesStatusActivatedNotApplied
source: Profile activated, but Mihomo apply failed.
zh_hans: 配置已激活，但应用到 Mihomo 失败。
zh_hant: 設定已啟用，但套用到 Mihomo 失敗。

# ProfilesStatusDeleted
source: Profile deleted.
zh_hans: 配置已删除。
zh_hant: 設定已刪除。

# ProfilesStatusFailed
source: Operation failed
zh_hans: 操作失败
zh_hant: 操作失敗

# ProfilesStatusNotMihomoCompatible
source: Profile saved, but this format cannot be applied directly to Mihomo.
zh_hans: 配置已保存，但当前格式不可直接应用到 Mihomo。
zh_hant: 設定已儲存，但目前格式無法直接套用到 Mihomo。

# ProxiesRefreshButton
source: Refresh Nodes
zh_hans: 刷新节点
zh_hant: 重新整理節點

# ProxiesTestAllButton
source: Test All
zh_hans: 测速全部
zh_hant: 測速全部

# ProxiesTestGroupButton
source: Test Group
zh_hans: 测速本组
zh_hant: 測速本組

# ProxiesTestNodeButton
source: Test Node
zh_hans: 测速节点
zh_hant: 測速節點

# ProxiesCurrentProxyLabel
source: Current
zh_hans: 当前节点
zh_hant: 目前節點

# ProxiesTestUrlPlaceholder
source: Latency test URL
zh_hans: 测速 URL
zh_hant: 測速 URL

# ProxiesStatusNoActiveProfile
source: No active profile. Go to Profiles page first.
zh_hans: 当前没有激活配置，请先到订阅页设置。
zh_hant: 目前沒有啟用中的設定，請先到訂閱頁面設定。

# ProxiesStatusLoaded
source: Loaded {0} nodes from Mihomo.
zh_hans: 已从 Mihomo 加载 {0} 个节点。
zh_hant: 已從 Mihomo 載入 {0} 個節點。

# ProxiesStatusLoadedNoApply
source: Loaded {0} nodes. Config apply failed, using current Mihomo state.
zh_hans: 已加载 {0} 个节点，但配置应用失败，使用当前 Mihomo 状态。
zh_hant: 已載入 {0} 個節點，但設定套用失敗，使用目前 Mihomo 狀態。

# ProxiesStatusLoadedIncompatibleProfile
source: Loaded {0} nodes from running Mihomo. Active profile format cannot be applied directly.
zh_hans: 已从当前运行中的 Mihomo 加载 {0} 个节点，激活配置格式不可直接应用。
zh_hant: 已從目前執行中的 Mihomo 載入 {0} 個節點，啟用中的設定格式無法直接套用。

# ProxiesStatusFallbackLoaded
source: Loaded {0} nodes from profile file (Mihomo API unavailable).
zh_hans: Mihomo API 不可用，已从配置文件加载 {0} 个节点。
zh_hant: Mihomo API 不可用，已從設定檔載入 {0} 個節點。

# ProxiesStatusFallbackLoadedIncompatibleProfile
source: Active profile format cannot be applied directly. Loaded {0} nodes from profile file.
zh_hans: 激活配置格式不可直接应用，已从配置文件加载 {0} 个节点。
zh_hant: 啟用中的設定格式無法直接套用，已從設定檔載入 {0} 個節點。

# ProxiesStatusDelayFailed
source: Delay test failed. Check Mihomo controller status.
zh_hans: 测速失败，请检查 Mihomo 控制器状态。
zh_hant: 測速失敗，請檢查 Mihomo 控制器狀態。

# ProxiesStatusDelaySuccess
source: {0} delay: {1} ms
zh_hans: {0} 延迟：{1} ms
zh_hant: {0} 延遲：{1} ms

# ProxiesStatusDelaySkippedNonTestable
source: Skipped delay test for non-testable node: {0}.
zh_hans: 已跳过不可测速节点：{0}。
zh_hant: 已跳過不可測速節點：{0}。

# ProxiesStatusDelayAllFinished
source: All node delay tests finished.
zh_hans: 全部节点测速完成。
zh_hant: 全部節點測速完成。

# ProxiesStatusDelayAllFinishedWithSkipped
source: All delay tests finished. Skipped {0} non-testable node(s).
zh_hans: 测速完成，已跳过 {0} 个不可测速节点。
zh_hant: 測速完成，已跳過 {0} 個不可測速節點。

# ProxiesStatusDelayGroupFinished
source: Delay test finished for group {0}.
zh_hans: 代理组 {0} 测速完成。
zh_hant: 代理群組 {0} 測速完成。

# ProxiesStatusDelayGroupFinishedWithSkipped
source: Delay test finished for group {0}. Skipped {1} non-testable node(s).
zh_hans: 代理组 {0} 测速完成，已跳过 {1} 个不可测速节点。
zh_hant: 代理群組 {0} 測速完成，已跳過 {1} 個不可測速節點。

# ProxiesStatusProxySelected
source: Proxy group {0} switched to {1}.
zh_hans: 已切换代理组 {0} 到节点 {1}。
zh_hant: 已切換代理群組 {0} 到節點 {1}。

# ProxiesStatusProxySelectFailed
source: Failed to switch proxy group {0} to {1}.
zh_hans: 切换代理组 {0} 到节点 {1} 失败。
zh_hant: 切換代理群組 {0} 到節點 {1} 失敗。

# ProxiesStatusProxyAlreadySelected
source: Proxy group {0} is already using {1}.
zh_hans: 代理组 {0} 当前已使用节点 {1}。
zh_hant: 代理群組 {0} 目前已使用節點 {1}。

# ProxiesStatusNoProxyGroups
source: No proxy groups were found in the current config.
zh_hans: 当前配置未找到可展示的代理组。
zh_hant: 目前設定未找到可顯示的代理群組。

# SettingsSectionUpdates
source: Updates
zh_hans: 更新
zh_hant: 更新

# SettingsUpdateCardDescription
source: Get updates from GitHub Releases
zh_hans: 从 GitHub Release 获取更新
zh_hant: 從 GitHub Release 取得更新

# SettingsUpdateCheckButton
source: Check for updates
zh_hans: 检查更新
zh_hant: 檢查更新

# SettingsUpdateStatusChecking
source: Checking for updates
zh_hans: 正在检查更新
zh_hant: 正在檢查更新

# SettingsUpdateStatusLatest
source: You are using the latest version
zh_hans: 你用的是最新版本
zh_hant: 您使用的是最新版本

# SettingsUpdateStatusAvailable
source: An update is available
zh_hans: 有可用的更新
zh_hant: 有可用的更新

# SettingsUpdateStatusUnavailable
source: Unable to get update information
zh_hans: 无法获取更新信息
zh_hant: 無法取得更新資訊

# SettingsUpdateStatusDownloading
source: Downloading update
zh_hans: 正在下载更新
zh_hant: 正在下載更新

# SettingsUpdateStatusLaunchingInstaller
source: Launching installer
zh_hans: 正在启动安装器
zh_hant: 正在啟動安裝程式

# SettingsUpdateStatusDownloadFailed
source: Failed to download the update or launch the installer
zh_hans: 更新下载或安装启动失败
zh_hant: 更新下載或安裝程式啟動失敗

# SettingsUpdateDownloadProgressIndeterminate
source: Downloading update
zh_hans: 正在下载更新
zh_hant: 正在下載更新

# SettingsUpdateDownloadProgressFormat
source: Downloaded {0}%
zh_hans: 已下载 {0}%
zh_hant: 已下載 {0}%

# SettingsSectionAbout
source: About
zh_hans: 关于
zh_hant: 關於

# SettingsAboutVersionFormat
source: Version {0}
zh_hans: 版本 {0}
zh_hant: 版本 {0}

# SettingsProfileLoadingStatus
source: Loading active profile diagnostics…
zh_hans: 正在加载当前配置诊断信息…
